app/Http/Controllers/User/KycController.php

select * from `basic_settings` limit 1
---
    public function index()
    {
        $basic_settings   = BasicSettings::first();