app/Http/Controllers/User/PaymentController.php

    public function index(){
        $page_title     = "Payment";
        $cards          = CardPayment::auth()->orderBy('id','desc')->get();
---
select * from `card_payments` where `user_id` = 1 order by `id` desc

    public function store(Request $request){
        $validator    = Validator::make($request->all(),[
            'card_type'         => 'required',
            'card_option'       => 'required',
            'name'              => 'required',
            'card_number'       => 'required',
            'card_cvc'          => 'required',
            'expiry_date'       => 'required',
        ]);
        if($validator->fails()){
            return back()->withErrors($validator)->withInput()->with('modal',true);
        }
        $validated              = $validator->validate();
        $validated['user_id']    = auth()->user()->id;
        $validated['slug']      = Str::uuid();
        try{
            CardPayment::create($validated);
---
insert into `card_payments` (`card_type`, `card_option`, `name`, `card_number`, `card_cvc`, `expiry_date`, `user_id`, `slug`, `updated_at`, `created_at`) values ('credit', '0', 'Amal Cardenas', '21214554547854', '564', '332', 1, '\"8a2a7f46-0c68-48cf-9c78-52bfde8b3eea\"', '2024-03-20 08:36:17', '2024-03-20 08:36:17')

    public function update(Request $request,$slug){
        $card               = CardPayment::where('slug',$slug)->first();
        if(!$card) return back()->with(['error' => ['Sorry! Card not found.']]);

        $validator          = Validator::make($request->all(),[
            'card_type'     => 'required',
            'card_option'   => 'required',
            'name'          => 'required',
            'card_number'   => 'required',
            'card_cvc'      => 'required',
            'expiry_date'   => 'required'
        ]);
        if($validator->fails()) return back()->withErrors($validator)->withInput()->with('modal','editModal');


        $validated              = $validator->validate();
        $validated['user_id']   = auth()->user()->id;

        try{
            $card->update($validated);
---
select * from `card_payments` where `slug` = '47b0a13d-3021-4a94-8dbe-d4299f10b845' limit 1
select * from `card_payments` where `slug` = '6f0e4f41-980d-4b8a-96ea-831eff53e7bc' limit 1
update `card_payments` set `card_type` = 'credit', `card_option` = '1', `card_payments`.`updated_at` = '2024-03-19 09:19:59' where `id` = 1