app/Http/Controllers/User/PaymentController.php

    public function delete($slug){
        $card   = CardPayment::where('slug',$slug)->first();
        if(!$card) return back()->with(['error' => ['Sorry! Card not found.']]);
        try{
            $card->delete();
---
select * from `card_payments` where `slug` = '78f851f7-9ea5-41c4-9a3c-3daa9b416e18' limit 1
delete from `card_payments` where `id` = 7