app/Http/Controllers/User/Auth/LoginController.php

select exists(select * from `users` where `email` = 'user@appdevs.net' and `status` = 0) as `exists`
---
    protected function validateLogin(Request $request)
    {
        $this->request_data = $request;
        $request->validate([
            'credentials'   => 'required|string',
            'password'      => 'required|string',
        ]);

        // if user exists with banner
        if(User::where($this->username(),$request->credentials)->where('status',GlobalConst::BANNED)->exists()) {