app/Http/Controllers/Frontend/AnnouncementController.php

    public function categoryIndex()
    {
        $page_title = "Announcement Category";
        $categories = AnnouncementCategory::orderByDesc("id")->get();
        $languages = Language::get();
---
select * from `announcement_categories` order by `id` desc
select * from `languages`

    public function categoryStore(Request $request)
    {
        $basic_field_name = [
            'name'          => "required|string|max:150",
        ];

        $data['language']  = $this->contentValidate($request,$basic_field_name);

        try{
            AnnouncementCategory::create([
                'name'          => $data,
                'created_at'    => now(),
                'status'        => true,
            ]);
---
insert into `announcement_categories` (`name`, `created_at`, `status`, `updated_at`) values ('{\"language\":{\"en\":{\"name\":\"Information Technology\"},\"es\":{\"name\":null},\"ar\":{\"name\":null}}}', '2024-03-27 10:12:33', 1, '2024-03-27 10:12:33')

    public function categoryUpdate(Request $request) {
        $validated = $request->validate([
            'target'    => "required|numeric|exists:announcement_categories,id",
        ]);

        $basic_field_name = [
            'name_edit'          => "required|string|max:250",
        ];

        $category = AnnouncementCategory::find($validated['target']);

        $language_wise_data = $this->contentValidate($request,$basic_field_name,"category-update");
        if($language_wise_data instanceof RedirectResponse) return $language_wise_data;

        $language_wise_data = array_map(function($language) {
            return replace_array_key($language,"_edit");
        },$language_wise_data);

        $data['language']  = $language_wise_data;

        try{
            $category->update([
                'name'      => $data,
            ]);
---
select * from `announcement_categories` where `announcement_categories`.`id` = '1' limit 1
update `announcement_categories` set `name` = '{\"language\":{\"en\":{\"name\":\"Blog1\"},\"es\":{\"name\":null},\"ar\":{\"name\":null}}}', `announcement_categories`.`updated_at` = '2024-03-27 07:26:17' where `id` = 1

    public function categoryStatusUpdate(Request $request) {
        $validator = Validator::make($request->all(), [
            'status'                    => 'required|boolean',
            'input_name'                => 'required|string',
            'data_target'               => 'required|integer|exists:announcement_categories,id',
        ]);

        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];
            return Response::error($error, null, 400);
        }
        $validated = $validator->validate();


        try {
            $category = AnnouncementCategory::find($validated['data_target']);
            if($category) {
                $category->update([
                    'status'    => ($validated['status'] == true) ? false : true,
                ]);
---
select * from `announcement_categories` where `announcement_categories`.`id` = '1' limit 1
update `announcement_categories` set `status` = 0, `announcement_categories`.`updated_at` = '2024-03-27 07:53:13' where `id` = 1

    public function categoryDelete(Request $request)
    {
        $request->validate([
            'target'    => "required|integer|exists:announcement_categories,id",
        ]);

        try{
            $category = AnnouncementCategory::find($request->target);
            if($category) $category->delete();
---
select * from `announcement_categories` where `announcement_categories`.`id` = '17' limit 1
delete from `announcement_categories` where `id` = 17

    public function announcementCreate() {
        $page_title = "Create New Announcement";
        $categories = AnnouncementCategory::orderByDesc("id")->where("status",GlobalConst::ACTIVE)->get();
        $languages = Language::get();
---
select * from `announcement_categories` where `status` = 1 order by `id` desc
select * from `languages`

    public function announcementStore(Request $request) {
        $basic_field_name = [
            'title'         => "required|string|max:255",
            'description'   => "required|string|max:5000000",
            'tags'          => "required|array",
        ];

        $data['language']  = $this->contentValidate($request,$basic_field_name);

        $validated = Validator::make($request->all(),[
            'category'  => "required|integer|exists:announcement_categories,id",
        ])->validate();

        // make slug
        $not_removable_lang = LanguageConst::NOT_REMOVABLE;
        $slug_text = $data['language'][$not_removable_lang]['title'] ?? "";
        if($slug_text == "") {
            $slug_text = $data['language'][get_default_language_code()]['title'] ?? "";
            if($slug_text == "") {
                $slug_text = Str::uuid();
            }
        }
        $slug = Str::slug(Str::lower($slug_text));

        if(Announcement::where('slug',$slug)->exists()) return back()->with(['error' => ['Announcement title is similar. Please update/change this title']]);
---
select exists(select * from `announcements` where `slug` = 'we-care-about-your-money-and-safety-far-far-away') as `exists`

    public function announcementEdit($id) {
        $announcement = Announcement::find($id);
        if(!$announcement) return back()->with(['error' => ['Announcement does\'t exists!']]);
        $page_title = "Announcement Edit";
        $languages = Language::get();
        $categories = AnnouncementCategory::where("status",GlobalConst::ACTIVE)->orderByDesc("id")->get();
---
select * from `announcements` where `announcements`.`id` = '15' limit 1
select * from `languages`
select * from `announcement_categories` where `status` = 1 order by `id` desc

    public function contentValidate($request,$basic_field_name,$modal = null) {
        $languages = Language::get();
---
select * from `languages`