app/Http/Controllers/Frontend/IndexController.php

    public function languageSwitch(Request $request) {
        $code = $request->target;
        $language = Language::where("code",$code)->first();
---
select * from `languages` where `code` = 'ar' limit 1

    public function webJournal(){
        $page_title     = "Web Journal";
        $journals        = Announcement::with(['category'])->where('status',true)->latest()->paginate(10);
---
select * from `announcements` where `status` = 1 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `announcements` where `status` = 1

    public function journalDetails($slug){
        $page_title             = "Journal Details";
        $journal                = Announcement::where('slug',$slug)->first();
        if(!$journal) return back()->with(['error' => ['Something went wrong! Please try again.']]);
        $category               = AnnouncementCategory::withCount('announcements')->where('status',true)->get();
        $recent_posts           = Announcement::where('status',true)->where('slug','!=',$slug)->get();
---
select * from `announcements` where `slug` = 'is-now-a-good-time-to-worry-more-about-financial' limit 1
select * from `announcements` where `status` = 1 and `slug` != 'is-now-a-good-time-to-worry-more-about-financial'