app/Http/Controllers/Admin/AdminCareController.php

select * from `admins` limit 10 offset 0
select count(*) as aggregate from `admins`
---
    public function index()
    {
        $page_title = "All Admin";
        $admins = Admin::paginate(10);

select * from `admin_roles`
select * from `admin_role_permissions`
---
    public function rolePermissionIndex()
    {

        $page_title = "Permission Group";
        $roles = AdminRole::get();
        $permissions = AdminRolePermission::get();

insert into `admin_role_permissions` (`name`, `admin_role_id`, `admin_id`, `slug`, `updated_at`, `created_at`) values ('Currency', '1', 1, 'currency', '2024-03-18 03:08:32', '2024-03-18 03:08:32')
---
    public function rolePermissionStore(Request $request)
    {

        $validator = Validator::make($request->all(), [
            'name'      => "required|string|max:60|unique:admin_role_permissions,name",
            'role'      => "required|integer|exists:admin_roles,id|unique:admin_role_permissions,admin_role_id",
        ]);

        if ($validator->fails()) {
            return back()->withErrors($validator)->withInput()->with("modal", "permission-add");
        }

        $validated = $validator->validate();
        $validated['admin_role_id'] = $validated['role'];
        $validated['admin_id']      = Auth::user()->id;
        $validated['slug']          = Str::slug($validated['name']);

        $validated = Arr::except($validated, ['role']);

        try {
            AdminRolePermission::create($validated);

select * from `admin_role_permissions` where `slug` = 'euro' limit 1
---
    public function viewRolePermission($slug)
    {
        $permission = AdminRolePermission::where("slug", $slug)->first();

select * from `admin_role_permissions` where `slug` = 'currency' limit 1
select `route` from `admin_role_has_permissions` where `admin_role_permission_id` = 2
---
    public function rolePermissionAssign(Request $request, $slug)
    {
        $permission = AdminRolePermission::where("slug", $slug)->first();
        if (!$permission) {
            return back()->with(['error' => ['Permission not found!']]);
        }

        $validator = Validator::make($request->all(), [
            'title.*'       => "required|string|max:100",
        ]);

        if ($validator->fails()) {
            return back()->withErrors($validator)->withInput()->with('modal', "permission-assign-add");
        }
        $has_permissions = AdminRoleHasPermission::where("admin_role_permission_id",$permission->id)->pluck("route")->toArray();

insert into `admin_role_has_permissions` (`admin_role_permission_id`, `created_at`, `last_edit_by`, `route`, `title`) values (2, '2024-03-18 03:08:45', 1, 'admin.currency.index', 'Currency Index')
---
        }

        try{
            AdminRoleHasPermission::insert($metch_items);