app/Http/Controllers/Admin/LanguageController.php

    public function index()
    {
        $page_title = "Language Manager";
        $languages = Language::paginate(10);
---
select * from `languages` limit 10 offset 0
select count(*) as aggregate from `languages`

    public function switch(Request $request) {
        $code = $request->target;
        $language = Language::where("code",$code);
        if(!$language->exists()) {
---
select exists(select * from `languages` where `code` = 'en') as `exists`