app/Http/Controllers/Admin/NFCPayConfigController.php

select * from `n_f_c_pay_configs` limit 1
---
    public function index(){
        $page_title     = "NFCPay Configuration";
        $data           = NFCPayConfig::first();