app/Http/Controllers/Admin/SetupEmailController.php

    public function configuration() {
        $page_title = "Email Method";
        $email_config = BasicSettings::first()->mail_config;
---
select * from `basic_settings` limit 1

    public function update(Request $request)
    {

        $validator = Validator::make($request->all(),[
            'method'        => 'required|string|in:smtp,php|max:20',
            'host'          => 'required|string|max:255',
            'port'          => 'required|numeric',
            'encryption'    => 'required|string|in:ssl,tls,auto|max:15',
            'username'      => 'required|string|max:60',
            'password'      => 'required|string|max:60'
        ]);

        $validated = $validator->validate();

        $basic_settings = BasicSettings::first();
---
select * from `basic_settings` limit 1