app/Http/Controllers/Admin/SetupSectionsController.php

select * from `site_sections` where (`key` = 'services-section') limit 1
---
    public function howItsWorkUpdate(Request $request,$slug){

        $basic_field_name = [
            'title'       => 'required|string|max:100',
            'heading'     => 'required|string|max:100',
        ];

        $slug     = Str::slug(SiteSectionConst::HOW_ITS_WORK_SECTION);
        $section  = SiteSections::where("key",$slug)->first();

select * from `site_sections` where `key` = 'about-us-section' limit 1
---
    public function aboutUsUpdate(Request $request,$slug) {

        $basic_field_name = [
            'title'       => "required|string|max:100",
            'heading'       => "required|string|max:100",
            'sub_heading'   => "required|string|max:1000",
        ];

        $slug = Str::slug(SiteSectionConst::ABOUT_US_SECTION);
        $section = SiteSections::where("key",$slug)->first();

select * from `site_sections` where `key` = 'announcement-section' limit 1
---
    public function aboutPageItemStore(Request $request,$slug) {

        $basic_field_name = [
            'title'         => "required|string|max:255",
            'description'   => "required|string|max:2000",
        ];

        $language_wise_data = $this->contentValidate($request,$basic_field_name,"about-page-item-add");
        if($language_wise_data instanceof RedirectResponse) return $language_wise_data;
        $slug = Str::slug(SiteSectionConst::ABOUT_PAGE_SECTION);
        $section = SiteSections::where("key",$slug)->first();

        if($section != null) {
            $section_data = json_decode(json_encode($section->value),true);
        }else {
            $section_data = [];
        }
        $unique_id = uniqid();

        $section_data['items'][$unique_id]['language'] = $language_wise_data;
        $section_data['items'][$unique_id]['id'] = $unique_id;

        $update_data['key'] = $slug;
        $update_data['value']   = $section_data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);

select `code`, `name` from `languages` where not `code` = 'en'
---
    public function languages() {
        $languages = Language::whereNot('code',LanguageConst::NOT_REMOVABLE)->select("code","name")->get()->toArray();