app/Http/Controllers/Admin/SetupPagesController.php

select * from `setup_pages`
---
    public function index()
    {
        $page_title = "Setup Pages";
        $setup_pages = SetupPage::get();