app/Http/Controllers/Admin/SetupSectionsController.php

    public function testimonialUpdate(Request $request,$slug) {
        $basic_field_name = [
            'heading' => "required|string|max:100",
            'sub_heading' => "required|string|max:255",
        ];

        $slug = Str::slug(SiteSectionConst::TESTIMONIAL);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'testimonial-section' limit 1