app/Http/Controllers/Admin/SetupSectionsController.php

    public function __construct()
    {
        $this->languages = Language::get();
---
select * from `languages`

    public function bannerUpdate(Request $request,$slug) {

        $basic_field_name = [
            'title' => "required|string|max:100",
            'heading' => "required|string|max:100",
            'sub_heading' => "required|string|max:500",
            'button_name' => "required|string|max:50",
        ];

        $slug = Str::slug(SiteSectionConst::BANNER_SECTION);
        $section = SiteSections::where("key",$slug)->first();
        $data['image'] = $section->value->image ?? null;
        if($request->hasFile("image")) {
            $data['image']      = $this->imageValidate($request,"image",$section->value->image ?? null);
        }

        $data['language']  = $this->contentValidate($request,$basic_field_name);
        $update_data['value']  = $data;
        $update_data['key']    = $slug;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'security-section' limit 1

    public function securityItemStore(Request $request,$slug) {
        $basic_field_name  = [
            'item_title'     => "required|string|max:255",
            'item_heading'       => "required|string|max:500",

        ];

        $language_wise_data = $this->contentValidate($request,$basic_field_name,"security-add");
        if($language_wise_data instanceof RedirectResponse) return $language_wise_data;
        $slug = Str::slug(SiteSectionConst::SECURITY_SECTION);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'security-section' limit 1

        $update_data['value']   = $section_data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where (`key` = 'security-section') limit 1

    public function securityItemUpdate(Request $request,$slug) {
        $request->validate([
            'target'         =>'required|string',
        ]);

        $basic_field_name = [
            'item_title_edit'  => "required|string|max:255",
            'item_heading_edit'    => "required|string|max:500",
        ];

        $slug              = Str::slug(SiteSectionConst::SECURITY_SECTION);
        $section           = SiteSections::getData($slug)->first();

        if(!$section) return back()->with(['error' => ['Section Not Found!']]);
        $section_values    = json_decode(json_encode($section->value),true);

        if(!isset($section_values['items'])) return back()->with(['error' => ['Section Item Not Found!']]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['[error' => ['Section Item is invalid']]);
---
select * from `site_sections` where `key` = 'services-section' limit 1

    public function securityStatusUpdate(Request $request,$slug) {

        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);

        if ($validator->stopOnFirstFailure()->fails()) {
            return Response::error($validator->errors()->all(),null,400);
        }

        $slug           = Str::slug(SiteSectionConst::SECURITY_SECTION);
        $section        = SiteSections::where("key",$slug)->first();
        if($section != null ){
            $data       = json_decode(json_encode($section->value),true);
        }else{
            $data       = [];
        }
        if(array_key_exists("items",$data) && array_key_exists($request->data_target,$data['items'])) {
            $data['items'][$request->data_target]['status'] = ($request->status == 1) ? 0 : 1;
        }else {
            return Response::error(['Items not found or invalid!'],[],404);
        }

        $section->update([
            'value'     => $data,
        ]);
---
select * from `site_sections` where `key` = 'security-section' limit 1
update `site_sections` set `value` = '{\"language\":{\"en\":{\"title\":\"Security System\",\"heading\":\"5 Ways To | Security System\"},\"es\":{\"title\":null,\"heading\":null},\"ar\":{\"title\":null,\"heading\":null}},\"items\":{\"66013034120dd\":{\"language\":{\"en\":{\"item_title\":\"SMS or Email Verification\",\"item_heading\":\"Dramatically supply transparent backward deliverables before caward comp internal or \\"organic\\" sources.\"},\"es\":{\"item_title\":null,\"item_heading\":null},\"ar\":{\"item_title\":null,\"item_heading\":null}},\"status\":1,\"id\":\"66013034120dd\",\"icon\":\"las la-envelope-open-text\"}}}', `site_sections`.`updated_at` = '2024-03-25 08:05:16' where `id` = 7

    public function howItsWorkUpdate(Request $request,$slug){

        $basic_field_name = [
            'title'       => 'required|string|max:100',
            'heading'     => 'required|string|max:100',
        ];

        $slug     = Str::slug(SiteSectionConst::HOW_ITS_WORK_SECTION);
        $section  = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'how-its-work-section' limit 1



        try{
            SiteSections::updateOrCreate(["key"=>$slug],$update_data);
---
select * from `site_sections` where (`key` = 'how-its-work-section') limit 1

    public function downloadAppItemDelete(Request $request,$slug){
        $request->validate([
            'target'     => 'required|string',
        ]);

        $slug         = Str::slug(SiteSectionConst::DOWNLOAD_APP_SECTION);
        $section      = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => ['Section item not found!']]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'statistic-section' limit 1

    public function statisticUpdate(Request $request,$slug){
        $basic_field_name = [
            'title'       => 'required|string|max:100',
            'heading'     => 'required|string|max:100',
            'sub_heading' => 'required|string',
        ];

        $slug             = Str::slug(SiteSectionConst::STATISTIC_SECTION);
        $section          = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'statistic-section' limit 1

        $update_data['key']   = $slug;
        $update_data['value'] = $data;
        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
insert into `site_sections` (`key`, `value`, `updated_at`, `created_at`) values ('statistic-section', '{\"image\":\"ff75ab28-d67d-4a55-a846-5d71bf5b8f4b.webp\",\"language\":{\"en\":{\"title\":\"Payment Gateway\",\"heading\":\"The Way of the Wayfinding Mark\",\"sub_heading\":\"xzfsdfgsdfg\"},\"es\":{\"title\":null,\"heading\":null,\"sub_heading\":null},\"ar\":{\"title\":null,\"heading\":null,\"sub_heading\":null}}}', '2024-03-27 10:20:58', '2024-03-27 10:20:58')
select * from `site_sections` where (`key` = 'statistic-section') limit 1

    public function statisticItemDelete(Request $request,$slug){
        $request->validate([
            'target'  => 'required|string',
        ]);

        $slug         = Str::slug(SiteSectionConst::STATISTIC_SECTION);
        $section      = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => ['Section item not found!']]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'about-us-section' limit 1

    public function aboutUsUpdate(Request $request,$slug) {

        $basic_field_name = [
            'title'       => "required|string|max:100",
            'heading'       => "required|string|max:100",
            'sub_heading'   => "required|string|max:1000",
        ];

        $slug = Str::slug(SiteSectionConst::ABOUT_US_SECTION);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where (`key` = 'about-us-section') limit 1

        $update_data['key']    = $slug;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'services-section' limit 1

    public function servicesItemDelete(Request $request,$slug) {
        $request->validate([
            'target'    => 'required|string',
        ]);
        $slug = Str::slug(SiteSectionConst::SERVICES_SECTION);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => ['Section item not found!']]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'testimonial-section' limit 1

    public function faqUpdate(Request $request,$slug) {

        $basic_field_name   = [
            'title'         => 'required|string|max:100',
            'heading'       => 'required|string|max:100',
        ];

        $slug           = Str::slug(SiteSectionConst::FAQ_SECTION);
        $section        = SiteSections::where("key",$slug)->first();
        if($section != null ){
            $data       = json_decode(json_encode($section->value),true);
        }else{
            $data       = [];
        }


        $data['language']      = $this->contentValidate($request,$basic_field_name);
        $update_data['key']    = $slug;
        $update_data['value']  = $data;

        try{
            SiteSections::updateOrCreate(['key'=>$slug],$update_data);
---
select * from `site_sections` where `key` = 'how-it-work' limit 1

    public function testimonialUpdate(Request $request,$slug) {
        $basic_field_name = [
            'heading' => "required|string|max:100",
            'sub_heading' => "required|string|max:255",
        ];

        $slug = Str::slug(SiteSectionConst::TESTIMONIAL);
        $section = SiteSections::where("key",$slug)->first();

        if($section != null) {
            $section_data = json_decode(json_encode($section->value),true);
        }else {
            $section_data = [];
        }

        $section_data['language']  = $this->contentValidate($request,$basic_field_name);

        $update_data['key']    = $slug;
        $update_data['value']  = $section_data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'footer-section' limit 1

    public function testimonialItemStore(Request $request,$slug) {

        $basic_field_name = [
            'comment'    => "required|string|max:1000",
        ];

        $language_wise_data = $this->contentValidate($request,$basic_field_name,"client-feedback-add");
        if($language_wise_data instanceof RedirectResponse) return $language_wise_data;
        $slug = Str::slug(SiteSectionConst::TESTIMONIAL);
        $section = SiteSections::where("key",$slug)->first();
---
select * from `site_sections` where `key` = 'footer-section' limit 1

    public function testimonialItemUpdate(Request $request,$slug) {
        $validator = Validator::make($request->all(),[
            'target'                => "required|string",
            'name_edit'             => "required|string|max:255",
            'designation_edit'      => "required|string|max:500",
            'image_edit'            => "nullable|image|mimes:jpg,png,svg,webp|max:10240",
        ]);

        if($validator->fails()) {
            return back()->withErrors($validator->errors())->withInput()->with('modal','client-feedback-update');
        }

        $validated = $validator->validate();

        $basic_field_name = [
            'comment_edit'     => "required|string|max:1000",
        ];

        $slug = Str::slug(SiteSectionConst::TESTIMONIAL);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => ['Section item not found!']]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'testimonial-section' limit 1

        }

        try{
            $section->update([
                'value' => $section_values,
            ]);
---
update `site_sections` set `value` = '{\"language\":{\"en\":{\"heading\":\"Testimonial\",\"sub_heading\":\"What People Say | About Us\"},\"es\":{\"heading\":null,\"sub_heading\":null},\"ar\":{\"heading\":null,\"sub_heading\":null}},\"items\":{\"6601421325487\":{\"language\":{\"en\":{\"comment\":\"Moreover general optional service in addition to the purchase of NFC Tags. We read all the Unique IDs (UID) of the Tags and send you via email.\"},\"es\":{\"comment\":null},\"ar\":{\"comment\":null}},\"id\":\"6601421325487\",\"image\":\"\",\"name\":\"Annette Black\",\"designation\":\"Founder & CEO\"},\"66014834a16e6\":{\"language\":{\"en\":{\"comment\":\"Moreover general optional service in addition to the purchase of NFC Tags. We read all the Unique IDs (UID) of the Tags and send you via email.\"},\"es\":{\"comment\":null},\"ar\":{\"comment\":null}},\"id\":\"66014834a16e6\",\"image\":\"a0a02133-2dcb-4aac-9c8f-1c5865907d30.webp\",\"name\":\"Groveri\",\"designation\":\"Software Engineer\"}}}', `site_sections`.`updated_at` = '2024-03-27 10:48:36' where `id` = 39

    public function announcementView($slug) {
        $page_title = "Announcement Section";
        $section_slug = Str::slug(SiteSectionConst::ANNOUNCEMENT_SECTION);
        $data = SiteSections::getData($section_slug)->first();
        $languages = $this->languages;

        $announcements = Announcement::get();
        $categories = AnnouncementCategory::get();
---
select * from `announcements`
select * from `announcement_categories`

    public function announcementUpdate(Request $request,$slug) {
        $basic_field_name = [
            'heading' => "required|string|max:100",
            'sub_heading' => "required|string|max:255",
        ];

        $slug = Str::slug(SiteSectionConst::ANNOUNCEMENT_SECTION);
        $section = SiteSections::where("key",$slug)->first();

        if($section != null) {
            $section_data = json_decode(json_encode($section->value),true);
        }else {
            $section_data = [];
        }

        $section_data['language']  = $this->contentValidate($request,$basic_field_name);

        $update_data['key']    = $slug;
        $update_data['value']  = $section_data;

        try{
            SiteSections::updateOrCreate(['key' => $slug],$update_data);
---
select * from `site_sections` where `key` = 'footer-section' limit 1

    public function aboutPageItemUpdate(Request $request,$slug) {

        $request->validate([
            'target'        => "required|string"
        ]);

        $basic_field_name = [
            'title_edit'     => "required|string|max:255",
            'description_edit'   => "required|string|max:3000",
        ];

        $slug = Str::slug(SiteSectionConst::ABOUT_PAGE_SECTION);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => ['Section item not found!']]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'register-section' limit 1

    public function aboutPageItemDelete(Request $request,$slug) {
        $request->validate([
            'target'    => 'required|string',
        ]);
        $slug = Str::slug(SiteSectionConst::ABOUT_PAGE_SECTION);
        $section = SiteSections::getData($slug)->first();
        if(!$section) return back()->with(['error' => ['Section not found!']]);
        $section_values = json_decode(json_encode($section->value),true);
        if(!isset($section_values['items'])) return back()->with(['error' => ['Section item not found!']]);
        if(!array_key_exists($request->target,$section_values['items'])) return back()->with(['error' => ['Section item is invalid!']]);
---
select * from `site_sections` where `key` = 'contact-us-section' limit 1

    public function languages() {
        $languages = Language::whereNot('code',LanguageConst::NOT_REMOVABLE)->select("code","name")->get()->toArray();
---
select `code`, `name` from `languages` where not `code` = 'en'